app/controllers/items_controller.rb

  def expensive
    @items = Item.where("price > 1000")
---
SELECT "items".* FROM "items" WHERE (price > 1000)

  def create # POST /items
   @item = Item.new(items_params)

      if @item.save
---
INSERT INTO "items" ("price", "name", "real", "weight", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["price", 500.0], ["name", "Cool good"], ["real", true], ["weight", 0.0], ["description", "good car"], ["created_at", 2017-05-08 13:10:32 UTC], ["updated_at", 2017-05-08 13:10:32 UTC]]

  def update # PUT /items/1

     @item.update_attributes(items_params)
---
UPDATE "items" SET "price" = ?, "name" = ?, "weight" = ?, "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", 1230.0], ["name", "Cool Item3"], ["weight", 32.01], ["description", "Super SUperee"], ["updated_at", 2017-05-10 10:04:45 UTC], ["id", 3]]

  def destroy # DELETE /items/1
    @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 14]]

  def upvote
    @item.increment!(:votes_count)
---
UPDATE "items" SET "votes_count" = COALESCE("votes_count", 0) + 1 WHERE "items"."id" = ?  [["id", 4]]

    def find_item
      @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]